Repository: Ale-O/symfony_crud
Catalog: translations/messages+intl-icu.*.xlf
Languages: fr

source: TIP
fr: ASTUCE

source: Not available
fr: Indisponible

# mit_license
source: MIT Licence
fr: Licence MIT

# http_error.name
source: Error {status_code, number}
fr: Erreur {status_code, number}

# http_error.description
source: There was an unknown error (HTTP {status_code, number}) that prevented to complete your request.
fr: Il y a eu une erreur inconnue (HTTP {status_code, number}) qui a empêché l'aboutissement de votre requête.

# http_error.suggestion
source: Try loading this page again in some minutes or <a href="{url}">go back to the homepage</a>.
fr: Essayez de recharger cette page dans quelques minutes ou <a href="{url}">retournez sur la page principale</a>.

# http_error_403.description
source: You don't have permission to access to this resource.
fr: Vous n'avez pas les droits pour accéder à cette ressource.

# http_error_403.suggestion
source: Ask your manager or system administrator to grant you access to this resource.
fr: Demandez à votre manager ou à votre administrateur système de vous donner les droits pour accéder à cette ressource.

# http_error_404.description
source: We couldn't find the page you requested.
fr: Nous n'avons pas pu trouver la page demandée.

# http_error_404.suggestion
source: Check out any misspelling in the URL or <a href="{url}">go back to the homepage</a>.
fr: Vérifiez si l'URL ne comporte pas d'erreurs ou <a href="{url}">retournez sur la page principale</a>.

# http_error_500.description
source: There was an internal server error.
fr: Il y a eu une erreur interne du serveur.

# http_error_500.suggestion
source: Try loading this page again in some minutes or <a href="{url}">go back to the homepage</a>.
fr: Essayez de recharger cette page dans quelques minutes ou <a href="{url}">retournez sur la page principale</a>.

# title.source_code
source: Source code used to render this page
fr: Le code source utilisé pour afficher cette page

# title.controller_code
source: Controller code
fr: Code du contrôleur

# title.twig_template_code
source: Twig template code
fr: Code du template Twig

# title.login
source: Secure connection
fr: Connexion sécurisée

# title.element_list
source: List of elements
fr: Liste des éléments

# title.fields_list
source: List of fields
fr: Liste des champs

# title.textfields_list
source: List of text fields
fr: Liste des champs textes

# title.datefields_list
source: List of date fields
fr: Liste des champs dates

# title.tag_list
source: List of tags
fr: Liste des tags

# title.user_list
source: List of users
fr: Liste des utilisateurs

# title.edit
source: Edit {id, number}
fr: Modifier {id, number}

# title.edit_element
source: Edit element #{id, number}
fr: Modifier l'élément #{id, number}

# title.add_subelement
source: Add registration
fr: Ajouter un sous-élément

# subelement.too_short
source: Registration content too short
fr: Contenu du sous-élément trop court

# element.too_short_content
source: Element content too short
fr: Contenu de l'élément trop court

# title.subelement_error
source: Registration creating error.
fr: Il y a eu une erreur lors de l'ajout du sous-élément.

# title.textfields_error
source: Text field edit error.
fr: Il y a eu une erreur lors de la modification du champs texte.

# title.datefields_error
source: Date field edit error.
fr: Il y a eu une erreur lors de la modification du champs date.

# title.edit_user
source: Edit user
fr: Modifier l'utilisateur

# title.change_password
source: Edit password
fr: Modifier le mot de passe

# action.show
source: Show
fr: Voir

# action.create_account
source: Create your account
fr: Créer son compte

# action.show_element
source: Show registration
fr: Voir l'élément

# action.show_code
source: Show code
fr: Voir le code

# action.edit
source: Edit
fr: Modifier

# action.edit_fields
source: Edit field
fr: Modifier les champs

# action.lock_fields
source: Lock field
fr: Vérrouiller les champs

# action.level_up
source: Upgrade to administrator
fr: Passer administrateur

# action.level_down
source: Downgrade to user
fr: Passer utilisateur

# action.level_up_successfully
source: You successfully upgrated to administrator
fr: Passage administrateur réussie

# action.level_down_successfully
source: You successfully downgrated to user
fr: Passage utilisateur réussie

# action.edit_element
source: Edit element
fr: Modifier l'élément

# action.save
source: Save
fr: Enregistrer

# action.delete
source: Delete
fr: Supprimer

# action.delete_element
source: Delete element
fr: Supprimer l'élément

# action.delete_subelement
source: Delete registration
fr: Supprimer le sous-élément

# delete_modal.title
source: Are you sure you want to delete ?
fr: Êtes-vous sûr de vouloir supprimer ?

# delete_element_modal.title
source: Are you sure you want to delete this element ?
fr: Êtes-vous sûr de vouloir supprimer cet élément ?

# delete_subelement_modal.title
source: Are you sure you want to delete this registration ?
fr: Êtes-vous sûr de vouloir supprimer ce sous-élément ?

# delete_modal.body
source: This action can't be cancelled.
fr: Cette action ne peut pas être annulée.

# delete_element_modal.body
source: The delete can't be cancelled.
fr: La suppression de l'élément ne peut pas être annulée.

# label.delete
source: Delete
fr: Supprimer

# label.delete_element
source: Delete element
fr: Supprimer l'élément

# label.delete_subelement
source: Delete registration
fr: Supprimer le sous-élément

# label.cancel
source: Cancel
fr: Annuler

# label.create
source: Create
fr: Créer

# label.create_fields
source: Create field
fr: Créer un champs

# label.create_element
source: Create element
fr: Créer un élément

# label.create_subelement
source: Create registration
fr: Créer un sous-élément

# label.create_tag
source: Create tag
fr: Créer un tag

# label.create_user
source: Create user
fr: Créer un utilisateur

# action.create
source: Create
fr: Créer

# action.create_element
source: Create new element
fr: Créer un nouvel élément

# action.create_subelement
source: Create registration
fr: Créer sous-élément

# label.save_and_create_new
source: Save and create new
fr: Enregistrer et créer un nouveau

# action.back_to_list
source: Back to list
fr: Retour à la liste des éléments

# action.back
source: Back
fr: Retour

# action.quick_add_subelement
source: Quick creation
fr: Création rapide

# action.sign_in
source: Login in
fr: Connectez-vous

# action.browse_admin
source: Login in
fr: Connexion

# action.edit_user
source: Edit user
fr: Modifier l'utilisateur

# action.change_password
source: Edit password
fr: Modifier le mot de passe

# label.too_many_tags
source: Too many tags
fr: Trop de tags

# label.id
source: ID
fr: Identifiant

# label.title
source: Title
fr: Titre

# label.name
source: Name
fr: Nom

# action.close
source: Close
fr: Fermer

# label.author
source: Creator
fr: Créateur

# label.author_email
source: Creator mail
fr: Mail du créateur

# label.username
source: ID
fr: Identifiant

# label.fullname
source: Name
fr: Nom

# label.password
source: Password
fr: Mot de passe

# label.current_password
source: Current password
fr: Mot de passe actuel

# label.new_password
source: New password
fr: Nouveau mot de passe

# label.new_password_confirm
source: Confirm password
fr: Confirmer le mot de passe

# label.isAdmin
source: Administrator profil
fr: Profil administrateur

# label.role
source: Role
fr: Rôle

# label.content
source: Content
fr: Contenu

# label.summary
source: Summary
fr: Résumé

# label.published_at
source: Published at
fr: Ajouter le

# title.fields_new
source: Add new field
fr: Ajouter un nouveau champs

# title.element_new
source: Add new element
fr: Ajouter un nouvel élément

# title.subelement_new
source: Add new registration
fr: Ajouter un nouveau sous-élément

# title.tag_new
source: Add new tag
fr: Ajouter un nouveau tag

# title.user_new
source: Add new user
fr: Ajouter un nouvel utilisateur

# action.edit_contents
source: Edit content
fr: Modifier le contenu

# menu.toggle_nav
source: Activate/Deactivate navigation
fr: Activer ou désactiver la navigation

# menu.choose_language
source: Choose language
fr: Choisir la langue

# menu.element_list
source: List of element
fr: Liste des éléments

# menu.back_to_crud
source: Back to navigation
fr: Retour à la navigation

# menu.tags
source: Manage tags
fr: Gestion des tags

# menu.admin
source: Database
fr: Base de donnée

# menu.user
source: Account
fr: Compte

# menu.users
source: Manage users
fr: Gestion des utilisateurs

# menu.logout
source: Logout
fr: Déconnexion

# menu.search
source: Search
fr: Recherche

# element.to_publish_a_subelement
source: For add registration
fr: pour rajouter un sous-élément

# fields.num_fields
source: {count, plural, one {# field} other {# fields}}
fr: {count, plural, one {# champs} other {# champs}}

# element.num_subelements
source: {count, plural, one {# registration} other {# registrations}}
fr: {count, plural, one {# sous-élément} other {# sous-éléments}}

# element.subelemented_on
source: Add at
fr: ajouté le

# fields.no_fields
source: No field found.
fr: Aucun champs détecté.

# element.no_subelements
source: Add the first registration.
fr: Ajouter un premier sous-élément.

# element.no_elements_found
source: No element found.
fr: Aucun élément trouvé.

# tag.no_tags_found
source: No tag found.
fr: Aucun tag trouvé.

# user.no_users_found
source: No user found.
fr: Aucun utilisateurs trouvés.

# action.created_successfully
source: Successfully created !
fr: Création réussie !

# element.created_successfully
source: Element successfully created !
fr: Elément créé avec succès !

# action.updated_successfully
source: Successfully updated !
fr: Mise à jour réussie !

# element.updated_successfully
source: Element successfully updated !
fr: Elément mis à jour avec succès !

# action.deleted_successfully
source: Successfully deleted !
fr: Suppression réussie !

# element.deleted_successfully
source: Element successfully deleted !
fr: Elément supprimé avec succès !

# subelement.deleted_successfully
source: Registration successfully deleted !
fr: Sous-élément supprimé avec succès !

# element.search_for
source: Search...
fr: Rechercher...

# element.search_no_results
source: No result
fr: Aucun résultat

# user.updated_successfully
source: information successfully updated !
fr: Informations mises à jour avec succès !

# notification.subelement_created
source: Your element has been completed with new registration !
fr: Votre élément a été complété par un sous-élément !

# notification.subelement_created.description
source: Your element "{title}" has been completed with new registration. You can see the new registration with <a href="{link}">this link</a>
fr: Votre élément "{title}" a été complété par un sous-élément. Vous pouvez lire le sous-élément en suivant <a href="{link}">ce lien</a>

# help.app_description
source: This <strong>CRUD</strong> has been built with the framework Symfony.
fr: Ceci est un <strong>CRUD</strong> construit avec le framework Symfony.

# help.show_code
source: Click to see the source code of the <strong>controller</strong> and <strong>template</strong> use to display this page.
fr: Cliquez sur ce bouton pour voir le code source du <strong>contrôleur</strong> et du <strong>template</strong> utilisé pour afficher cette page.

# help.browse_app
source: <strong>Public</strong> space without connection
fr: Espace <strong>Public</strong> sans connexion

# help.first_connect
source: You have not <strong>account</strong>
fr: Vous n'avez pas de <strong>compte</strong>

# help.browse_admin
source: Login to your <strong>account</strong>.
fr: Connectez-vous à votre <strong>compte</strong>.

# help.login_users
source: Try one of these users
fr: Essayez l'un des utilisateurs suivants

# help.role_user
source: Normal user
fr: utilisateur normal

# help.role_admin
source: Administrator
fr: administrateur

# help.reload_fixtures
source: If these users don't word, reload the application fixtures excuting this command from the terminal :
fr: Si ces utilisateurs ne fonctionnent pas, rechargez les fixtures de l'application en exécutant cette commande depuis le terminal :

# help.add_user
source: If you want to create new users, excute this command :
fr: Si vous voulez créer de nouveaux utilisateurs, exécutez cette autre commande :

# help.more_information
source: For more informatins, consult the <a href="https://symfony.com/doc">documentation of Symfony</a>.
fr: Pour plus d'informations, consultez la <a href="https://symfony.com/doc">documentation de Symfony</a>.

# help.element_summary
source: The summary can't have Markdown content or HTML ; only brut text.
fr: Les résumés ne peuvent pas contenir de contenu Markdown ou HTML ; seulement du texte brut.

# help.element_publication
source: Select the future publication date.
fr: Sélectionnez une date future pour programmer le rajout de l'élément.

# help.element_content
source: Use the Markdown to formate the element content. HTML is also authorized.
fr: Utilisez du Markdown pour formater le contenu de l'élément. Le HTML est également autorisé.

# help.subelement_content
source: Registration description.
fr: Description du sous-élément.

# info.change_password
source: After updating yout password, you will be disconnecting from the application.
fr: Après avoir modifié votre mot de passe, vous serez déconnecté de l'application.

# rss.title
source: Crud
fr: Crud de démo Symfony

# rss.description
source: Last elements created
fr: Derniers éléments ajoutés sur le CRUD

# paginator.previous
source: Previous
fr: Précédent

# paginator.next
source: Next
fr: Suivant

# paginator.current
source: Current page
fr: Page actuelle

source: Year
fr: Année

source: Month
fr: Mois

source: Day
fr: Jour
